{
  "greeting": "Hi, I'm Dinesh",
  "bio": "I'm Dineshkumar, a Front-End Developer with 7 years of experience building fast, scalable, and maintainable web applications using Angular and TypeScript. I focus on clean code, reusable UI components, and solving complex problems with efficient, user-centric solutions.",
  "skills": [
    {
      "title": "UI/UX Design Implementation",
      "description": "I bring UI/UX designs to life—converting static concepts into intuitive, responsive, and engaging user interfaces. With a strong eye for detail, accessibility, and visual consistency, I help turn great design into exceptional user experience.",
      "icon": "architecture",
      "bgColor": "#E8F4FF",
      "iconColor": "#5B9FED"
    },
    {
      "title": "Frontend Technologies",
      "description": "I maintain a strong foundation in HTML, CSS, and JavaScript, and enhance my expertise with Angular  to build flexible and modern front-end solutions. I focus on resolving browser inconsistencies, improving performance, and ensuring seamless scalability. By prioritizing compatibility, responsiveness, and user experience, I deliver reliable, high-quality applications that align with both user expectations and business goals.",
      "icon": "code",
      "bgColor": "#FFE8F0",
      "iconColor": "#ff4586"
    },
    {
      "title": "SEO Implementation",
      "description": "I incorporate SEO best practices into front-end development to enhance website visibility and search engine ranking. This includes optimizing HTML structure, meta tags, and schema markup while ensuring fast loading performance and mobile responsiveness. The result is a user-friendly and search-efficient experience that supports both technical quality and business growth.",
      "icon": "travel_explore",
      "bgColor": "#FFF0E8",
      "iconColor": "#ff4586"
    },
    {
      "title": "Collaboration and Communication",
      "description": "As a frontend developer, I prioritize effective collaboration with cross-functional teams, including backend developers, designers, and clients, to ensure alignment on project goals and requirements. Clear communication is essential throughout the development process, fostering a collaborative environment and contributing to project success.",
      "icon": "people",
      "bgColor": "#E8FFF0",
      "iconColor": "#5B9FED"
    }
  ]
}